sysbench_test_PostgreSQL_High_Concurrency.log
========================================
Sysbench Test Parameters:
TABLES=50, TABLE_SIZE=100000, THREADS=100, TIME=600, REPORT_INTERVAL=10
========================================
[1/3] Preparing data...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=50 --table-size=100000 prepare
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 100000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 100000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 100000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 100000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 100000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 100000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 100000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 100000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 100000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 100000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
Creating table 'sbtest11'...
Inserting 100000 records into 'sbtest11'
Creating a secondary index on 'sbtest11'...
Creating table 'sbtest12'...
Inserting 100000 records into 'sbtest12'
Creating a secondary index on 'sbtest12'...
Creating table 'sbtest13'...
Inserting 100000 records into 'sbtest13'
Creating a secondary index on 'sbtest13'...
Creating table 'sbtest14'...
Inserting 100000 records into 'sbtest14'
Creating a secondary index on 'sbtest14'...
Creating table 'sbtest15'...
Inserting 100000 records into 'sbtest15'
Creating a secondary index on 'sbtest15'...
Creating table 'sbtest16'...
Inserting 100000 records into 'sbtest16'
Creating a secondary index on 'sbtest16'...
Creating table 'sbtest17'...
Inserting 100000 records into 'sbtest17'
Creating a secondary index on 'sbtest17'...
Creating table 'sbtest18'...
Inserting 100000 records into 'sbtest18'
Creating a secondary index on 'sbtest18'...
Creating table 'sbtest19'...
Inserting 100000 records into 'sbtest19'
Creating a secondary index on 'sbtest19'...
Creating table 'sbtest20'...
Inserting 100000 records into 'sbtest20'
Creating a secondary index on 'sbtest20'...
Creating table 'sbtest21'...
Inserting 100000 records into 'sbtest21'
Creating a secondary index on 'sbtest21'...
Creating table 'sbtest22'...
Inserting 100000 records into 'sbtest22'
Creating a secondary index on 'sbtest22'...
Creating table 'sbtest23'...
Inserting 100000 records into 'sbtest23'
Creating a secondary index on 'sbtest23'...
Creating table 'sbtest24'...
Inserting 100000 records into 'sbtest24'
Creating a secondary index on 'sbtest24'...
Creating table 'sbtest25'...
Inserting 100000 records into 'sbtest25'
Creating a secondary index on 'sbtest25'...
Creating table 'sbtest26'...
Inserting 100000 records into 'sbtest26'
Creating a secondary index on 'sbtest26'...
Creating table 'sbtest27'...
Inserting 100000 records into 'sbtest27'
Creating a secondary index on 'sbtest27'...
Creating table 'sbtest28'...
Inserting 100000 records into 'sbtest28'
Creating a secondary index on 'sbtest28'...
Creating table 'sbtest29'...
Inserting 100000 records into 'sbtest29'
Creating a secondary index on 'sbtest29'...
Creating table 'sbtest30'...
Inserting 100000 records into 'sbtest30'
Creating a secondary index on 'sbtest30'...
Creating table 'sbtest31'...
Inserting 100000 records into 'sbtest31'
Creating a secondary index on 'sbtest31'...
Creating table 'sbtest32'...
Inserting 100000 records into 'sbtest32'
Creating a secondary index on 'sbtest32'...
Creating table 'sbtest33'...
Inserting 100000 records into 'sbtest33'
Creating a secondary index on 'sbtest33'...
Creating table 'sbtest34'...
Inserting 100000 records into 'sbtest34'
Creating a secondary index on 'sbtest34'...
Creating table 'sbtest35'...
Inserting 100000 records into 'sbtest35'
Creating a secondary index on 'sbtest35'...
Creating table 'sbtest36'...
Inserting 100000 records into 'sbtest36'
Creating a secondary index on 'sbtest36'...
Creating table 'sbtest37'...
Inserting 100000 records into 'sbtest37'
Creating a secondary index on 'sbtest37'...
Creating table 'sbtest38'...
Inserting 100000 records into 'sbtest38'
Creating a secondary index on 'sbtest38'...
Creating table 'sbtest39'...
Inserting 100000 records into 'sbtest39'
Creating a secondary index on 'sbtest39'...
Creating table 'sbtest40'...
Inserting 100000 records into 'sbtest40'
Creating a secondary index on 'sbtest40'...
Creating table 'sbtest41'...
Inserting 100000 records into 'sbtest41'
Creating a secondary index on 'sbtest41'...
Creating table 'sbtest42'...
Inserting 100000 records into 'sbtest42'
Creating a secondary index on 'sbtest42'...
Creating table 'sbtest43'...
Inserting 100000 records into 'sbtest43'
Creating a secondary index on 'sbtest43'...
Creating table 'sbtest44'...
Inserting 100000 records into 'sbtest44'
Creating a secondary index on 'sbtest44'...
Creating table 'sbtest45'...
Inserting 100000 records into 'sbtest45'
Creating a secondary index on 'sbtest45'...
Creating table 'sbtest46'...
Inserting 100000 records into 'sbtest46'
Creating a secondary index on 'sbtest46'...
Creating table 'sbtest47'...
Inserting 100000 records into 'sbtest47'
Creating a secondary index on 'sbtest47'...
Creating table 'sbtest48'...
Inserting 100000 records into 'sbtest48'
Creating a secondary index on 'sbtest48'...
Creating table 'sbtest49'...
Inserting 100000 records into 'sbtest49'
Creating a secondary index on 'sbtest49'...
Creating table 'sbtest50'...
Inserting 100000 records into 'sbtest50'
Creating a secondary index on 'sbtest50'...
[2/3] Running benchmark...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=50 --table-size=100000 --threads=100 --time=600 --report-interval=10 run
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 100
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 100 tps: 3697.91 qps: 74203.51 (r/w/o: 51955.95/14827.94/7419.62) lat (ms,95%): 50.11 err/s: 3.50 reconn/s: 0.00
[ 20s ] thds: 100 tps: 4047.59 qps: 81013.14 (r/w/o: 56714.02/16190.55/8108.57) lat (ms,95%): 43.39 err/s: 3.30 reconn/s: 0.00
[ 30s ] thds: 100 tps: 3938.32 qps: 78792.38 (r/w/o: 55162.83/15740.30/7889.25) lat (ms,95%): 46.63 err/s: 3.00 reconn/s: 0.00
[ 40s ] thds: 100 tps: 3877.00 qps: 77609.26 (r/w/o: 54326.64/15516.11/7766.51) lat (ms,95%): 46.63 err/s: 3.20 reconn/s: 0.00
[ 50s ] thds: 100 tps: 3927.97 qps: 78593.55 (r/w/o: 55025.21/15699.79/7868.54) lat (ms,95%): 46.63 err/s: 3.40 reconn/s: 0.00
[ 60s ] thds: 100 tps: 3841.59 qps: 76907.06 (r/w/o: 53840.83/15368.45/7697.78) lat (ms,95%): 48.34 err/s: 4.00 reconn/s: 0.00
[ 70s ] thds: 100 tps: 3853.49 qps: 77111.17 (r/w/o: 53981.94/15406.65/7722.58) lat (ms,95%): 45.79 err/s: 4.40 reconn/s: 0.00
[ 80s ] thds: 100 tps: 3843.42 qps: 76976.61 (r/w/o: 53883.52/15392.96/7700.13) lat (ms,95%): 46.63 err/s: 2.50 reconn/s: 0.00
[ 90s ] thds: 100 tps: 3690.58 qps: 73862.24 (r/w/o: 51709.18/14761.11/7391.95) lat (ms,95%): 51.02 err/s: 2.80 reconn/s: 0.00
[ 100s ] thds: 100 tps: 3701.47 qps: 74096.76 (r/w/o: 51875.42/14805.09/7416.25) lat (ms,95%): 49.21 err/s: 3.40 reconn/s: 0.00
[ 110s ] thds: 100 tps: 3664.85 qps: 73354.30 (r/w/o: 51352.90/14657.50/7343.90) lat (ms,95%): 51.02 err/s: 3.40 reconn/s: 0.00
[ 120s ] thds: 100 tps: 3783.70 qps: 75700.22 (r/w/o: 52996.85/15123.88/7579.49) lat (ms,95%): 48.34 err/s: 3.60 reconn/s: 0.00
[ 130s ] thds: 100 tps: 3827.64 qps: 76614.65 (r/w/o: 53634.13/15311.55/7668.98) lat (ms,95%): 47.47 err/s: 3.30 reconn/s: 0.00
[ 140s ] thds: 100 tps: 3845.86 qps: 77008.62 (r/w/o: 53907.35/15397.04/7704.22) lat (ms,95%): 48.34 err/s: 3.00 reconn/s: 0.00
[ 150s ] thds: 100 tps: 3966.03 qps: 79338.31 (r/w/o: 55544.16/15847.00/7947.15) lat (ms,95%): 44.98 err/s: 3.70 reconn/s: 0.00
[ 160s ] thds: 100 tps: 3988.32 qps: 79849.61 (r/w/o: 55899.62/15958.66/7991.33) lat (ms,95%): 44.17 err/s: 3.20 reconn/s: 0.00
[ 170s ] thds: 100 tps: 3592.50 qps: 71914.78 (r/w/o: 50346.96/14367.62/7200.21) lat (ms,95%): 53.85 err/s: 3.80 reconn/s: 0.00
[ 180s ] thds: 100 tps: 3796.79 qps: 76010.09 (r/w/o: 53213.82/15188.38/7607.89) lat (ms,95%): 47.47 err/s: 3.70 reconn/s: 0.00
[ 190s ] thds: 100 tps: 3775.47 qps: 75584.86 (r/w/o: 52913.85/15104.97/7566.04) lat (ms,95%): 48.34 err/s: 3.80 reconn/s: 0.00
[ 200s ] thds: 100 tps: 3824.22 qps: 76553.75 (r/w/o: 53591.52/15297.99/7664.25) lat (ms,95%): 50.11 err/s: 4.20 reconn/s: 0.00
[ 210s ] thds: 100 tps: 3712.70 qps: 74254.48 (r/w/o: 51980.86/14834.82/7438.81) lat (ms,95%): 51.02 err/s: 3.10 reconn/s: 0.00
[ 220s ] thds: 100 tps: 3619.50 qps: 72496.62 (r/w/o: 50755.15/14490.38/7251.09) lat (ms,95%): 51.94 err/s: 3.00 reconn/s: 0.00
[ 230s ] thds: 100 tps: 3656.82 qps: 73222.10 (r/w/o: 51254.35/14640.20/7327.55) lat (ms,95%): 52.89 err/s: 3.30 reconn/s: 0.00
[ 240s ] thds: 100 tps: 3666.99 qps: 73386.21 (r/w/o: 51382.17/14656.06/7347.98) lat (ms,95%): 51.02 err/s: 3.80 reconn/s: 0.00
[ 250s ] thds: 100 tps: 3905.59 qps: 78156.34 (r/w/o: 54715.99/15614.17/7826.18) lat (ms,95%): 44.98 err/s: 4.00 reconn/s: 0.00
[ 260s ] thds: 100 tps: 3797.21 qps: 76067.65 (r/w/o: 53245.38/15210.55/7611.73) lat (ms,95%): 50.11 err/s: 3.70 reconn/s: 0.00
[ 270s ] thds: 100 tps: 3908.19 qps: 78204.30 (r/w/o: 54750.49/15623.04/7830.77) lat (ms,95%): 46.63 err/s: 3.70 reconn/s: 0.00
[ 280s ] thds: 100 tps: 3646.40 qps: 72988.25 (r/w/o: 51100.74/14579.31/7308.21) lat (ms,95%): 50.11 err/s: 4.10 reconn/s: 0.00
[ 290s ] thds: 100 tps: 3738.40 qps: 74838.41 (r/w/o: 52390.70/14957.10/7490.60) lat (ms,95%): 50.11 err/s: 3.80 reconn/s: 0.00
[ 300s ] thds: 100 tps: 3684.29 qps: 73785.03 (r/w/o: 51647.48/14755.97/7381.58) lat (ms,95%): 49.21 err/s: 3.20 reconn/s: 0.00
[ 310s ] thds: 100 tps: 3849.22 qps: 77006.71 (r/w/o: 53915.01/15378.26/7713.43) lat (ms,95%): 45.79 err/s: 3.70 reconn/s: 0.00
[ 320s ] thds: 100 tps: 3771.09 qps: 75469.69 (r/w/o: 52836.52/15078.68/7554.49) lat (ms,95%): 48.34 err/s: 3.00 reconn/s: 0.00
[ 330s ] thds: 100 tps: 3814.78 qps: 76352.61 (r/w/o: 53451.76/15258.50/7642.35) lat (ms,95%): 46.63 err/s: 2.60 reconn/s: 0.00
[ 340s ] thds: 100 tps: 3525.30 qps: 70566.70 (r/w/o: 49398.40/14103.70/7064.60) lat (ms,95%): 52.89 err/s: 3.40 reconn/s: 0.00
[ 350s ] thds: 100 tps: 3752.32 qps: 75133.52 (r/w/o: 52596.69/15017.98/7518.84) lat (ms,95%): 48.34 err/s: 3.60 reconn/s: 0.00
[ 360s ] thds: 100 tps: 3643.80 qps: 72898.55 (r/w/o: 51038.76/14559.99/7299.79) lat (ms,95%): 50.11 err/s: 3.00 reconn/s: 0.00
[ 370s ] thds: 100 tps: 3791.81 qps: 75899.43 (r/w/o: 53128.39/15175.53/7595.51) lat (ms,95%): 49.21 err/s: 2.70 reconn/s: 0.00
[ 380s ] thds: 100 tps: 3746.40 qps: 75007.19 (r/w/o: 52508.87/14991.22/7507.11) lat (ms,95%): 49.21 err/s: 3.70 reconn/s: 0.00
[ 390s ] thds: 100 tps: 3792.11 qps: 75921.26 (r/w/o: 53150.01/15171.73/7599.52) lat (ms,95%): 46.63 err/s: 3.90 reconn/s: 0.00
[ 400s ] thds: 100 tps: 3469.39 qps: 69421.11 (r/w/o: 48602.47/13867.86/6950.78) lat (ms,95%): 53.85 err/s: 3.30 reconn/s: 0.00
[ 410s ] thds: 100 tps: 3620.49 qps: 72490.88 (r/w/o: 50748.12/14487.98/7254.79) lat (ms,95%): 51.94 err/s: 3.80 reconn/s: 0.00
[ 420s ] thds: 100 tps: 3617.00 qps: 72413.20 (r/w/o: 50693.00/14473.10/7247.10) lat (ms,95%): 49.21 err/s: 3.60 reconn/s: 0.00
[ 430s ] thds: 100 tps: 3698.50 qps: 74047.49 (r/w/o: 51841.29/14796.60/7409.60) lat (ms,95%): 48.34 err/s: 4.30 reconn/s: 0.00
[ 440s ] thds: 100 tps: 3597.05 qps: 71983.15 (r/w/o: 50392.06/14383.69/7207.39) lat (ms,95%): 53.85 err/s: 3.20 reconn/s: 0.00
[ 450s ] thds: 100 tps: 3804.61 qps: 76153.09 (r/w/o: 53310.10/15220.76/7622.23) lat (ms,95%): 47.47 err/s: 3.70 reconn/s: 0.00
[ 460s ] thds: 100 tps: 3488.44 qps: 69828.80 (r/w/o: 48889.03/13949.88/6989.89) lat (ms,95%): 54.83 err/s: 3.30 reconn/s: 0.00
[ 470s ] thds: 100 tps: 3247.79 qps: 65015.04 (r/w/o: 45512.29/12995.97/6506.78) lat (ms,95%): 62.19 err/s: 2.90 reconn/s: 0.00
[ 480s ] thds: 100 tps: 3292.68 qps: 65931.94 (r/w/o: 46156.15/13176.93/6598.86) lat (ms,95%): 57.87 err/s: 3.80 reconn/s: 0.00
[ 490s ] thds: 100 tps: 3490.52 qps: 69886.03 (r/w/o: 48921.53/13969.37/6995.13) lat (ms,95%): 52.89 err/s: 3.40 reconn/s: 0.00
[ 500s ] thds: 100 tps: 3555.72 qps: 71141.95 (r/w/o: 49807.25/14210.37/7124.34) lat (ms,95%): 53.85 err/s: 3.30 reconn/s: 0.00
[ 510s ] thds: 100 tps: 3730.70 qps: 74712.17 (r/w/o: 52303.85/14933.11/7475.21) lat (ms,95%): 48.34 err/s: 4.10 reconn/s: 0.00
[ 520s ] thds: 100 tps: 3716.13 qps: 74330.84 (r/w/o: 52046.25/14838.43/7446.16) lat (ms,95%): 48.34 err/s: 3.00 reconn/s: 0.00
[ 530s ] thds: 100 tps: 3402.66 qps: 68115.12 (r/w/o: 47680.28/13618.72/6816.11) lat (ms,95%): 54.83 err/s: 2.40 reconn/s: 0.00
[ 540s ] thds: 100 tps: 3472.91 qps: 69467.72 (r/w/o: 48633.96/13878.44/6955.32) lat (ms,95%): 57.87 err/s: 2.30 reconn/s: 0.00
[ 550s ] thds: 100 tps: 3589.50 qps: 71913.54 (r/w/o: 50336.33/14384.11/7193.10) lat (ms,95%): 49.21 err/s: 3.60 reconn/s: 0.00
[ 560s ] thds: 100 tps: 3518.80 qps: 70418.75 (r/w/o: 49291.73/14077.81/7049.20) lat (ms,95%): 52.89 err/s: 2.40 reconn/s: 0.00
[ 570s ] thds: 100 tps: 3614.76 qps: 72344.27 (r/w/o: 50645.69/14455.25/7243.33) lat (ms,95%): 53.85 err/s: 3.40 reconn/s: 0.00
[ 580s ] thds: 100 tps: 3703.83 qps: 74163.29 (r/w/o: 51921.91/14819.42/7421.96) lat (ms,95%): 51.02 err/s: 3.80 reconn/s: 0.00
[ 590s ] thds: 100 tps: 3667.00 qps: 73390.47 (r/w/o: 51383.75/14658.11/7348.61) lat (ms,95%): 48.34 err/s: 4.10 reconn/s: 0.00
[ 600s ] thds: 100 tps: 3328.70 qps: 66610.91 (r/w/o: 46629.14/13313.68/6668.09) lat (ms,95%): 55.82 err/s: 2.60 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            31128986
        write:                           8885901
        other:                           4450997
        total:                           44465884
    transactions:                        2221451 (3701.94 per sec.)
    queries:                             44465884 (74100.14 per sec.)
    ignored errors:                      2048   (3.41 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0776s
    total number of events:              2221451

Latency (ms):
         min:                                  3.90
         avg:                                 27.01
         max:                                250.07
         95th percentile:                     50.11
         sum:                            59995901.13

Threads fairness:
    events (avg/stddev):           22214.5100/113.58
    execution time (avg/stddev):   599.9590/0.02

[3/3] Cleaning up...
sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=pgsql --pgsql-host=127.0.0.1 --pgsql-port=5434 --pgsql-user=postgres --pgsql-password=postgres --pgsql-db=postgres --tables=50 --table-size=100000 cleanup
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
Dropping table 'sbtest11'...
Dropping table 'sbtest12'...
Dropping table 'sbtest13'...
Dropping table 'sbtest14'...
Dropping table 'sbtest15'...
Dropping table 'sbtest16'...
Dropping table 'sbtest17'...
Dropping table 'sbtest18'...
Dropping table 'sbtest19'...
Dropping table 'sbtest20'...
Dropping table 'sbtest21'...
Dropping table 'sbtest22'...
Dropping table 'sbtest23'...
Dropping table 'sbtest24'...
Dropping table 'sbtest25'...
Dropping table 'sbtest26'...
Dropping table 'sbtest27'...
Dropping table 'sbtest28'...
Dropping table 'sbtest29'...
Dropping table 'sbtest30'...
Dropping table 'sbtest31'...
Dropping table 'sbtest32'...
Dropping table 'sbtest33'...
Dropping table 'sbtest34'...
Dropping table 'sbtest35'...
Dropping table 'sbtest36'...
Dropping table 'sbtest37'...
Dropping table 'sbtest38'...
Dropping table 'sbtest39'...
Dropping table 'sbtest40'...
Dropping table 'sbtest41'...
Dropping table 'sbtest42'...
Dropping table 'sbtest43'...
Dropping table 'sbtest44'...
Dropping table 'sbtest45'...
Dropping table 'sbtest46'...
Dropping table 'sbtest47'...
Dropping table 'sbtest48'...
Dropping table 'sbtest49'...
Dropping table 'sbtest50'...
========================================
Sysbench full test completed. Results saved to sysbench_test_20241221_145618.log